# Project 6: Importing & Merging many files (Baby Names Dataset) - Part 1

## Importing one File & Understanding the Data Structure

In [1]:
import pandas as pd

In [2]:
# no columns, header or labels
pd.read_csv("yob1880.txt")

           Mary  F  7065
0          Anna  F  2604
1          Emma  F  2003
2     Elizabeth  F  1939
3        Minnie  F  1746
4      Margaret  F  1578
...         ... ..   ...
1994     Woodie  M     5
1995     Worthy  M     5
1996     Wright  M     5
1997       York  M     5
1998  Zachariah  M     5

[1999 rows x 3 columns]

In [3]:
df = pd.read_csv("yob1880.txt", header = None, names = ["Name", "Gender", "Count"])

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    2000 non-null   object
 1   Gender  2000 non-null   object
 2   Count   2000 non-null   int64
dtypes: int64(1), object(2)
memory usage: 47.0+ KB

## Importing & merging many files (easy case)

In [5]:
import pandas as pd

In [6]:
df_1880 = pd.read_csv("yob1880.txt", header = None, names = ["Name", "Gender", "Count"])
df_1880

           Name Gender  Count
0          Mary      F   7065
1          Anna      F   2604
2          Emma      F   2003
3     Elizabeth      F   1939
4        Minnie      F   1746
...         ...    ...    ...
1995     Woodie      M      5
1996     Worthy      M      5
1997     Wright      M      5
1998       York      M      5
1999  Zachariah      M      5

[2000 rows x 3 columns]

In [7]:
df_1881 = pd.read_csv("yob1881.txt", header = None, names = ["Name", "Gender", "Count"])
df_1881

           Name Gender  Count
0          Mary      F   6919
1          Anna      F   2698
2          Emma      F   2034
3     Elizabeth      F   1852
4      Margaret      F   1658
...         ...    ...    ...
1930     Wiliam      M      5
1931     Wilton      M      5
1932       Wing      M      5
1933       Wood      M      5
1934     Wright      M      5

[1935 rows x 3 columns]

In [8]:
pd.concat(objs = [df_1880, df_1881], axis = 0, keys = [1880, 1881], names = ["Year"])

                Name Gender  Count
Year
1880 0          Mary      F   7065
     1          Anna      F   2604
     2          Emma      F   2003
     3     Elizabeth      F   1939
     4        Minnie      F   1746
...              ...    ...    ...
1881 1930     Wiliam      M      5
     1931     Wilton      M      5
     1932       Wing      M      5
     1933       Wood      M      5
     1934     Wright      M      5

[3935 rows x 3 columns]

In [ ]:
# going to create data in this interesting format
pd.concat(objs = [df_1880, df_1881], axis = 0, keys = [1880, 1881],
          names = ["Year"]).droplevel(-1).reset_index()

In [ ]:
pd.read_csv("yob{}.txt".format(1880), header = None, names = ["Name", "Gender", "Count"])

In [ ]:
years = list(range(1880, 2019))
years

In [ ]:
dataframes = []
for year in years:
    data = pd.read_csv("yob{}.txt".format(year), header = None, 
                       names = ["Name", "Gender", "Count"])
    dataframes.append(data)

In [ ]:
dataframes

In [ ]:
len(dataframes)

In [ ]:
df = pd.concat(dataframes,  axis = 0, keys = years, names = ["Year"]).droplevel(-1).reset_index()

In [ ]:
df

In [ ]:
df.info()

## Final Steps

In [ ]:
df.to_csv("us_baby_names.csv", index = False)

In [ ]:
pd.read_csv("us_baby_names.csv")